# StairsDbgShowRightRunBoundary2d Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowRightRunBoundary2d Property
ParameterTypeId Class See Also
---
"Show Run's Right Boundary 2D"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowRightRunBoundary2d { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowRightRunBoundary2d As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowRightRunBoundary2d {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace